results/blogPost/benchclient1/quarkus-io-thread-45000-WARM-UP.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.146ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.144ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.143ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.145ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.13ms  510.50us   4.50ms   63.17%
    Req/Sec    11.86k   667.54    14.56k    72.38%
  2697267 requests in 1.00m, 133.76MB read
Requests/sec:  44954.57
Transfer/sec:      2.23MB