results/blogPost/benchclient1/quarkus-io-thread-48000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.142ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.130ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.132ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.161ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.13ms  509.52us   3.63ms   63.42%
    Req/Sec    12.65k   707.52    15.67k    70.06%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.09ms
 75.000%    1.51ms
 90.000%    1.84ms
 99.000%    2.32ms
 99.900%    2.72ms
 99.990%    3.05ms
 99.999%    3.26ms
100.000%    3.63ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.065     0.000000            1         1.00
       0.488     0.100000       240297         1.11
       0.646     0.200000       479353         1.25
       0.792     0.300000       718419         1.43
       0.938     0.400000       958373         1.67
       1.089     0.500000      1197555         2.00
       1.168     0.550000      1316790         2.22
       1.251     0.600000      1437612         2.50
       1.336     0.650000      1557257         2.86
       1.423     0.700000      1676895         3.33
       1.512     0.750000      1795956         4.00
       1.559     0.775000      1856638         4.44
       1.606     0.800000      1915387         5.00
       1.657     0.825000      1975726         5.71
       1.711     0.850000      2035942         6.67
       1.769     0.875000      2095148         8.00
       1.801     0.887500      2125032         8.89
       1.835     0.900000      2155152        10.00
       1.871     0.912500      2184772        11.43
       1.911     0.925000      2214748        13.33
       1.956     0.937500      2244715        16.00
       1.981     0.943750      2259460        17.78
       2.008     0.950000      2274674        20.00
       2.037     0.956250      2289300        22.86
       2.071     0.962500      2304924        26.67
       2.107     0.968750      2319312        32.00
       2.129     0.971875      2327054        35.56
       2.153     0.975000      2334656        40.00
       2.179     0.978125      2341934        45.71
       2.209     0.981250      2349404        53.33
       2.243     0.984375      2356791        64.00
       2.261     0.985938      2360340        71.11
       2.283     0.987500      2364256        80.00
       2.307     0.989062      2368007        91.43
       2.333     0.990625      2371544       106.67
       2.365     0.992188      2375310       128.00
       2.383     0.992969      2377208       142.22
       2.403     0.993750      2379097       160.00
       2.427     0.994531      2381052       182.86
       2.451     0.995313      2382785       213.33
       2.483     0.996094      2384673       256.00
       2.501     0.996484      2385610       284.44
       2.521     0.996875      2386520       320.00
       2.547     0.997266      2387509       365.71
       2.571     0.997656      2388378       426.67
       2.603     0.998047      2389321       512.00
       2.623     0.998242      2389783       568.89
       2.645     0.998437      2390276       640.00
       2.667     0.998633      2390716       731.43
       2.697     0.998828      2391197       853.33
       2.727     0.999023      2391653      1024.00
       2.747     0.999121      2391900      1137.78
       2.767     0.999219      2392131      1280.00
       2.789     0.999316      2392352      1462.86
       2.815     0.999414      2392592      1706.67
       2.845     0.999512      2392827      2048.00
       2.863     0.999561      2392941      2275.56
       2.883     0.999609      2393061      2560.00
       2.905     0.999658      2393178      2925.71
       2.927     0.999707      2393286      3413.33
       2.951     0.999756      2393407      4096.00
       2.967     0.999780      2393468      4551.11
       2.979     0.999805      2393526      5120.00
       2.995     0.999829      2393578      5851.43
       3.015     0.999854      2393638      6826.67
       3.033     0.999878      2393700      8192.00
       3.041     0.999890      2393726      9102.22
       3.057     0.999902      2393755     10240.00
       3.073     0.999915      2393784     11702.86
       3.087     0.999927      2393816     13653.33
       3.101     0.999939      2393844     16384.00
       3.107     0.999945      2393856     18204.44
       3.115     0.999951      2393870     20480.00
       3.127     0.999957      2393886     23405.71
       3.141     0.999963      2393899     27306.67
       3.157     0.999969      2393915     32768.00
       3.167     0.999973      2393921     36408.89
       3.173     0.999976      2393928     40960.00
       3.187     0.999979      2393936     46811.43
       3.207     0.999982      2393943     54613.33
       3.219     0.999985      2393950     65536.00
       3.231     0.999986      2393954     72817.78
       3.239     0.999988      2393957     81920.00
       3.253     0.999989      2393961     93622.86
       3.271     0.999991      2393965    109226.67
       3.289     0.999992      2393968    131072.00
       3.307     0.999993      2393970    145635.56
       3.311     0.999994      2393972    163840.00
       3.317     0.999995      2393974    187245.71
       3.329     0.999995      2393976    218453.33
       3.333     0.999996      2393977    262144.00
       3.335     0.999997      2393979    291271.11
       3.335     0.999997      2393979    327680.00
       3.337     0.999997      2393980    374491.43
       3.351     0.999998      2393981    436906.67
       3.367     0.999998      2393982    524288.00
       3.367     0.999998      2393982    582542.22
       3.389     0.999998      2393983    655360.00
       3.389     0.999999      2393983    748982.86
       3.393     0.999999      2393984    873813.33
       3.393     0.999999      2393984   1048576.00
       3.393     0.999999      2393984   1165084.44
       3.447     0.999999      2393985   1310720.00
       3.447     0.999999      2393985   1497965.71
       3.447     0.999999      2393985   1747626.67
       3.447     1.000000      2393985   2097152.00
       3.447     1.000000      2393985   2330168.89
       3.635     1.000000      2393986   2621440.00
       3.635     1.000000      2393986          inf
#[Mean    =        1.133, StdDeviation   =        0.510]
#[Max     =        3.634, Total count    =      2393986]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2877090 requests in 1.00m, 142.68MB read
Requests/sec:  47951.46
Transfer/sec:      2.38MB