results/blogPost/benchclient1/quarkus-io-thread-48000-WARM-UP.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.144ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.146ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.141ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.144ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.13ms  508.28us   3.70ms   63.38%
    Req/Sec    12.65k   709.61    15.78k    69.48%
  2876999 requests in 1.00m, 142.67MB read
Requests/sec:  47951.50
Transfer/sec:      2.38MB