results/blogPost/benchclient1/quarkus-io-thread-50000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.139ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.106ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.124ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.113ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.11ms  528.21us   7.06ms   63.80%
    Req/Sec    13.18k   738.76    21.33k    71.87%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.06ms
 75.000%    1.49ms
 90.000%    1.85ms
 99.000%    2.36ms
 99.900%    2.76ms
 99.990%    3.24ms
 99.999%    5.66ms
100.000%    7.06ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.057     0.000000            1         1.00
       0.440     0.100000       249376         1.11
       0.615     0.200000       498736         1.25
       0.767     0.300000       748852         1.43
       0.912     0.400000       998597         1.67
       1.060     0.500000      1248047         2.00
       1.135     0.550000      1372344         2.22
       1.215     0.600000      1496707         2.50
       1.301     0.650000      1622165         2.86
       1.394     0.700000      1745752         3.33
       1.494     0.750000      1870367         4.00
       1.547     0.775000      1933346         4.44
       1.601     0.800000      1995461         5.00
       1.658     0.825000      2057726         5.71
       1.718     0.850000      2120628         6.67
       1.780     0.875000      2182898         8.00
       1.813     0.887500      2213561         8.89
       1.848     0.900000      2244398        10.00
       1.886     0.912500      2275602        11.43
       1.928     0.925000      2306978        13.33
       1.976     0.937500      2338243        16.00
       2.002     0.943750      2353457        17.78
       2.030     0.950000      2369122        20.00
       2.061     0.956250      2385283        22.86
       2.095     0.962500      2400910        26.67
       2.133     0.968750      2416041        32.00
       2.155     0.971875      2423878        35.56
       2.179     0.975000      2431544        40.00
       2.207     0.978125      2439354        45.71
       2.239     0.981250      2447317        53.33
       2.275     0.984375      2455064        64.00
       2.295     0.985938      2458886        71.11
       2.317     0.987500      2462712        80.00
       2.343     0.989062      2466593        91.43
       2.371     0.990625      2470316       106.67
       2.405     0.992188      2474339       128.00
       2.423     0.992969      2476325       142.22
       2.441     0.993750      2478083       160.00
       2.465     0.994531      2480105       182.86
       2.491     0.995313      2482026       213.33
       2.521     0.996094      2483918       256.00
       2.539     0.996484      2484914       284.44
       2.559     0.996875      2485954       320.00
       2.579     0.997266      2486841       365.71
       2.607     0.997656      2487875       426.67
       2.639     0.998047      2488811       512.00
       2.657     0.998242      2489280       568.89
       2.681     0.998437      2489790       640.00
       2.705     0.998633      2490263       731.43
       2.733     0.998828      2490748       853.33
       2.765     0.999023      2491229      1024.00
       2.783     0.999121      2491461      1137.78
       2.811     0.999219      2491725      1280.00
       2.833     0.999316      2491948      1462.86
       2.865     0.999414      2492191      1706.67
       2.901     0.999512      2492442      2048.00
       2.917     0.999561      2492564      2275.56
       2.937     0.999609      2492684      2560.00
       2.965     0.999658      2492812      2925.71
       2.995     0.999707      2492926      3413.33
       3.035     0.999756      2493045      4096.00
       3.057     0.999780      2493106      4551.11
       3.081     0.999805      2493166      5120.00
       3.111     0.999829      2493230      5851.43
       3.137     0.999854      2493288      6826.67
       3.179     0.999878      2493348      8192.00
       3.219     0.999890      2493381      9102.22
       3.253     0.999902      2493409     10240.00
       3.307     0.999915      2493439     11702.86
       3.469     0.999927      2493470     13653.33
       3.687     0.999939      2493500     16384.00
       3.913     0.999945      2493516     18204.44
       4.135     0.999951      2493531     20480.00
       4.351     0.999957      2493546     23405.71
       4.591     0.999963      2493561     27306.67
       4.899     0.999969      2493576     32768.00
       5.075     0.999973      2493584     36408.89
       5.111     0.999976      2493592     40960.00
       5.239     0.999979      2493599     46811.43
       5.415     0.999982      2493607     54613.33
       5.547     0.999985      2493614     65536.00
       5.579     0.999986      2493618     72817.78
       5.607     0.999988      2493622     81920.00
       5.651     0.999989      2493626     93622.86
       5.691     0.999991      2493630    109226.67
       5.731     0.999992      2493633    131072.00
       5.963     0.999993      2493635    145635.56
       6.027     0.999994      2493637    163840.00
       6.047     0.999995      2493639    187245.71
       6.079     0.999995      2493641    218453.33
       6.087     0.999996      2493643    262144.00
       6.119     0.999997      2493644    291271.11
       6.155     0.999997      2493645    327680.00
       6.235     0.999997      2493646    374491.43
       6.271     0.999998      2493647    436906.67
       6.275     0.999998      2493648    524288.00
       6.275     0.999998      2493648    582542.22
       6.879     0.999998      2493649    655360.00
       6.879     0.999999      2493649    748982.86
       6.903     0.999999      2493650    873813.33
       6.903     0.999999      2493650   1048576.00
       6.903     0.999999      2493650   1165084.44
       7.055     0.999999      2493651   1310720.00
       7.055     0.999999      2493651   1497965.71
       7.055     0.999999      2493651   1747626.67
       7.055     1.000000      2493651   2097152.00
       7.055     1.000000      2493651   2330168.89
       7.063     1.000000      2493652   2621440.00
       7.063     1.000000      2493652          inf
#[Mean    =        1.111, StdDeviation   =        0.528]
#[Max     =        7.060, Total count    =      2493652]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2996879 requests in 1.00m, 148.62MB read
Requests/sec:  49948.86
Transfer/sec:      2.48MB